/******************************************************************************
文 件 名    1改错题
作    者    潘翔
班    级	物联网1601
学    号    U201614898
邮    箱    1007458378@qq.com
课    程    C语言程序设计
作 业 号    1改错题
截止日期    2016年5月4日

简述：
源程序改错
******************************************************************************/

#include<stdio.h>
void sort(int[], int);;
int main(void)
{
	int a[10] = { 27, 13, 5, 32, 23, 3, 17, 43, 55, 39 };
	int i;
	sort(a, 10);
	for (i = 0; i < 10; i++)
		printf("%6d", a[i]);
	printf("\n");
	return 0;
}
void sort(int b[], int n)
{
	int i, j, t;
	for (i = 0; i < n - 1; i++)
		for (j = 0; j < n - i - 1; j++)
			if (b[j] > b[j + 1])
				t = b[j], b[j] = b[j + 1], b[j + 1] = t;
}