/******************************************************************************
文 件 名	HW06_01
作    者    潘翔
班    级	物联网1601
学    号    U201614898
邮    箱    1007458378@qq.com
课    程    C语言程序设计
作 业 号    HW06_01
截止日期    2016年5月18日
简述：
使用指针
已知一个长整型变量占4个字节，其中每个字节又分成高4位和低4位。试从该整型变量的高字节开始，依次取出每个字节的高四位和低四位并以其值的十六进制字符（大写）形式进行显示。
输入：第一行为正整数N，表示有N组输入；每组输入为一个整数，第二行即为N个整数。
输出：每组输入对应一行输出，每两个字符用空格隔开，每行最后一个字符后无空格
6
1 0 88888 90 -23 10
0 0 0 0 0 0 0 1
0 0 0 0 0 0 0 0
0 0 0 1 5 B 3 8
0 0 0 0 0 0 5 A
F F F F F F E 9
0 0 0 0 0 0 0 A
******************************************************************************/

#include<stdio.h>
void Address(long int *p);

int main()
{
	long int L;
	long int* p_L=&L;
	int N;
	scanf("%d", &N);
	for (int i = 1;i<=N;i++)
	{
		scanf("%ld", &L);
		Address(&L);
		printf("\n");
	}
	return 0;
}

void Address(long int *p)
{
	//int high, low;
	unsigned mask = 0xf0000000;
	printf("%X ", (unsigned )(mask&*p) >> 28);
	for (int i = 1; i <= 6; i++) 
	{
		mask >>= 4;
		printf("%X ", (unsigned)(mask&*p) >> (28 - 4 * i));
	}
	mask >>= 4;
	printf("%X", (unsigned)(mask&*p));
}



