/******************************************************************************
文 件 名    1改错题 
作    者    潘翔 
班    级	物联网1601
学    号    U201614898
邮    箱    1007458378@qq.com 
课    程    C语言程序设计
作 业 号    1改错题 
截止日期    2016年4月13日

简述：
 源程序改错 
******************************************************************************/


#include <stdio.h>
void main(void)
{
	int i, n, s = 1;
	printf("Please enter n:");
	scanf("%d", &n);
	
	i = 1;
	while (i <= n)
	{
		s = s*i;
		i++;
	}
	printf("%d! = %d", n, s);
}
/*for (i = 1; i <= n; i++)
s = s*i;*/
