/******************************************************************************
文 件 名	1表达式求值的程序验证题
作    者    潘翔
班    级	物联网1601
学    号    U201614898
邮    箱    1007458378@qq.com
课    程    C语言程序设计
作 业 号    1表达式求值的程序验证题 
截止日期    2016年5月25日
简述：
******************************************************************************/

char u[]="UVWXYZ";
char v[]="xyz";
struct T{
	int x;
	char c;
	char *t;
}a[]={{11,'A',u},{100, 'B',v}},*p=a;

#include<stdio.h>

int main()
{
	//1
	p = a;
	printf("1.(++p)->x = %d\n",(++p)->x);
	//2
	p = a;
	p++;
	printf("2.p++,p->c = %c\n",p->c);
	//3
	p = a;
	printf("3.*p++->t,*p->t = %c\n", *p++->t, *p->t);
	//4 
	p = a;
	printf("4.*(++p)->t = %c\n", *(++p)->t);
	//5 
	p = a;
	printf("5.*++p->t = %c\n", *++p->t);
	//6 
	p = a;
	p->t = u;
	printf("6.++*p->t = %c\n", ++*p->t);
	return 0;
} 
