/******************************************************************************
文 件 名    HW05_02
作    者    潘翔
班    级	物联网1601
学    号    U201614898
邮    箱    1007458378@qq.com
课    程    C语言程序设计
作 业 号    HW05_02
截止日期    2016年5月4日

简述：
编写一个程序，其功能要求是：输入一个整数，将它在内存中二进制表示的每一位转换成为对应的数字字符，存放到一个字符数组中，然后输出该整数的二进制表示。
输入：第一行为正整数N，表示有N组输入；第二行为N个int型整数，即N组输入。
输出：对每组输入的整数，输出其二进制表示，每组一行 

样例输入
8
1 1024 26 0 -1 65 4 -1024
样例输出
00000000000000000000010000000000
00000000000000000000000000011010
00000000000000000000000000000000
11111111111111111111111111111111
00000000000000000000000001000001
00000000000000000000000000000100
1111 1111 1111 1111 1111 1100 0000 0000

******************************************************************************/
#include<stdio.h>

void ToBin(int n);

int N;
int i;
int BIN[100][33];

int main()
{
	int n = 0;
	
	scanf("%d", &n);
	for (i = 1; i <= n; i++)
	{
		scanf("%d", &N);
		ToBin(N);
	}
	return 0;
}

void ToBin(int N)
{
	int t;
	t = 1;
	t = t << 31;
	for (int j = 1; j <= 32; j++)
	{
		BIN[i][j]=( N&t ? '1' : '0');
		printf("%c",BIN[i][j]);
		N = N<< 1;
	}
	printf("\n");
}
