/******************************************************************************
文 件 名    自设题
作    者    潘翔
班    级	物联网1601
学    号    U201614898
邮    箱    1007458378@qq.com
课    程    C语言程序设计
作 业 号    自设题
截止日期    2016年5月4日

简述：
描述：
输入一个n维矩阵 求它的行列式
输入：
维数为n的数组
输出：
它的行列式

测试用例： 
5
1 2 3 4 5
2 1 3 4 5
3 1 2 4 5
4 1 2 3 5
5 1 2 3 4
5
1 1 1 1 1
1 1 1 1 1
1 1 1 1 1
1 1 1 1 1
1 1 1 1 1
******************************************************************************/


#include<stdio.h>
#include<math.h>

int countA(int a[100][100], int n);

int main()
{
	int a[100][100];
	int i, j;
	int n;
	scanf("%d", &n);
	for (i = 1; i <= n; i++)
	{
		for (j = 1; j <= n; j++)
		{
			scanf("%d", &a[i][j]);
		}
	}
	printf("%d\n", countA(a,n));
	return 0;
}

int countA(int a[100][100], int n)
{
	int b[100][100] = { { 0 } }; 
	int i = 0, j = 0, sum = 0;	 //i,j为行与列,sum为行列式的值
	int x = 0, c = 0, p = 0;	//用x判断加与减符号
	if (n == 1)
	{
		return a[0][0];
	}	
	for (i = 0; i < n; i++) //余子式存储
	{
		for (c = 0; c < n - 1; c++)
		{
			for (j = 0; j < n - 1; j++)
			{
				if (c < i)		//判断行列式的移动方向
				{			
					p = 0;      //当p=0时,行列式只向左移,即消去对应的第一列的数
				}
				else 
				{               //否则行列式左移后再上移
					p = 1;
				}
				b[c][j] = a[c + p][j + 1];
			}
		}
		if (i % 2 == 0) {      //i+j（此时j=0）为偶数,加法
			x = 1;
		}
		else				   //i+j为奇数,减法
		{              
			x = (-1);
		}
		sum += a[i][0] * countA(b,n-1) * x; //计算行列式的值
	}
	return sum; 
}
